import 'package:gpt_prompt_builder/features/prompt_generation/domain/models/prompt_subcategory_models.dart';

List<PromptSubCategory> subCategories = <PromptSubCategory>[
  // 1. Общие
  PromptSubCategory(
    category: 'Общие',
    subCategory: [
      "Повседневные задачи",
      "Организация времени",
      "Лайфхаки и советы",
      "Мотивация и психология",
      "Коммуникация и общение",
      "Новости и тренды",
      "Советы по здоровью и фитнесу",
      "Управление финансами",
      "Творчество и вдохновение",
    ],
  ),
  // 2. Креатив и тексты
  PromptSubCategory(
    category: 'Креатив и тексты',
    subCategory: [
      "Написание статей и блогов",
      "Сценарии и рассказы",
      "Поэзия и лирика",
      "Рекламные тексты и слоганы",
      "Копирайтинг",
      "Редактирование и корректура",
      "Креативные задания и игры",
      "Создание мемов и шуток",
      "Креативное мышление",
      "Контент для соцсетей",
    ],
  ),

  // 3. ИИ и технологии
  PromptSubCategory(
    category: 'ИИ и технологии',
    subCategory: [
      "Машинное обучение",
      "Нейросети и глубокое обучение",
      "Робототехника",
      "Обработка естественного языка (NLP)",
      "Компьютерное зрение",
      "Технологии распознавания речи",
      "Автоматизация и боты",
      "Будущее ИИ",
      "Этические вопросы ИИ",
      "Обзор и новости технологий",
    ],
  ),

  // 4. Разработка кода
  PromptSubCategory(
    category: 'Разработка кода',
    subCategory: [
      "Веб-разработка",
      "Мобильная разработка",
      "Backend и серверы",
      "Frontend и UI/UX",
      "Языки программирования",
      "Базы данных и SQL",
      "API и интеграции",
      "Тестирование и отладка",
      "DevOps и CI/CD",
      "Open Source и коллаборация",
    ],
  ),

  // 5. Обучение и развитие
  PromptSubCategory(
    category: 'Обучение и развитие',
    subCategory: [
      "Саморазвитие и личностный рост",
      "Изучение языков",
      "Онлайн-курсы и платформы",
      "Методики запоминания",
      "Навыки критического мышления",
      "Планирование учебы",
      "Образовательные игры",
      "Психология обучения",
      "Тренировка мозга",
      "Менторство и коучинг",
      "Развитие креативности",
    ],
  ),

  // 6. Бизнес и карьера
  PromptSubCategory(
    category: 'Бизнес и карьера',
    subCategory: [
      "Стартапы и предпринимательство",
      "Лидерство и управление командой",
      "Маркетинг и продажи",
      "Финансовое планирование",
      "Карьерный рост и смена профессии",
      "Нетворкинг и связи",
      "Личные бренды",
      "Переговоры и убеждение",
      "Аналитика и стратегии",
      "Юридические аспекты бизнеса",
    ],
  ),

  // 7. Графика и визуалы
  PromptSubCategory(
    category: 'Графика и визуалы',
    subCategory: [
      "Дизайн интерфейсов (UI/UX)",
      "Иллюстрация и арт",
      "Фотография и обработка фото",
      "Видео и монтаж",
      "Анимация и моушн-дизайн",
      "3D-моделирование",
      "Визуализация данных",
      "Цветовые схемы и теория цвета",
      "Типографика",
      "Инфографика",
    ],
  ),

  // 8. Культура и переводы
  PromptSubCategory(
    category: 'Культура и переводы',
    subCategory: [
      "Литература и книги",
      "История и традиции",
      "Искусство и музеи",
      "Музыка и театры",
      "Кинематограф",
      "Языки и диалекты",
      "Переводческие техники",
      "Межкультурные коммуникации",
      "Фольклор и мифология",
      "Современные культурные тренды",
    ],
  ),

  // 9. Развлечения
  PromptSubCategory(
    category: 'Развлечения',
    subCategory: [
      "Игры и геймдизайн",
      "Кино и сериалы",
      "Музыка и плейлисты",
      "Юмор и мемы",
      "Путешествия и туризм",
      "Хобби и DIY",
      "Косплей и фан-культура",
      "Вечеринки и события",
      "Книги и комиксы",
      "Видеоблоги и стриминг",
    ],
  ),
];
